print('Hello world!')
print('Hello python411')
# Pyhton  - интерпритируемы мультипарагменный язык програмирования с динамической строкой
# интерпритируемы - читаемый построчно
# парадигма - подход к програмирвонию. Бывают парадигмы: объемтно ориентированное, фунционнальное, процедиурное, процедурноориентирование,
# Переменные
x = 10 # не указываем тип данных, это означает, что типиация динамическая
# int x = 10 означает что типизация статическая

10 + 10 - 100 # в Python только переменные с одним типом данных